Documents/ЛБ_УстановкаНачальныхСтатусовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаНачальныхСтатусовКлиентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_СтатусыЗалогодателей</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_АрхивныеДанныеКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_АрхивныеДанныеКлиента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОбъектовЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИзъято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИзъято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтгруженоЦО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОтгруженоЦО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРеализовано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеализовано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКлиентаНаДатуВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКлиентаНаДатуВыкупаРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_УстановкаНачальныхСтатусовКлиентов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПроверкаСтатуса(КоличествоЗалогов, КоличествоВыкупов)
	Если КоличествоЗалогов >= 3	Тогда
		Коэфф = КоличествоВыкупов/КоличествоЗалогов*100;					
		Если Коэфф <= 30 Тогда
			Возврат Справочники.ЛБ_СтатусыЗалогодателей.Невыкупающий;
		ИначеЕсли Коэфф >= 70 Тогда     
			СтатусЗ =  Справочники.ЛБ_СтатусыЗалогодателей.Добросовестный;   
			Если КоличествоЗалогов >= 5 И Коэфф >= 90 Тогда	
			    СтатусЗ = Справочники.ЛБ_СтатусыЗалогодателей.Постоянный;
			КонецЕсли;
			Возврат СтатусЗ;
		Иначе    
			Возврат Справочники.ЛБ_СтатусыЗалогодателей.Неопределенный;
		КонецЕсли;
	Иначе
		Возврат Справочники.ЛБ_СтатусыЗалогодателей.Новый;
	КонецЕсли;		
КонецФункции	
	
Функция РассчитатьСтатусы() 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АрхивныеДанныеКлиента.Клиент КАК Клиент,
	               |	ЛБ_АрхивныеДанныеКлиента.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АрхивныеДанныеКлиента.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета
	               |ИЗ
	               |	РегистрСведений.ЛБ_АрхивныеДанныеКлиента КАК ЛБ_АрхивныеДанныеКлиента
	               |ГДЕ
	               |	ЛБ_АрхивныеДанныеКлиента.Период <= &Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаЗапроса;
КонецФункции
	
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)     
	Движения.ЛБ_СтатусыЗалогодателей.Записывать = Истина;

	ТаблицаСтатусов = РассчитатьСтатусы();  
	ТаблицаКлиентов = ТаблицаСтатусов.Скопировать();
	ТаблицаКлиентов.Свернуть("Клиент");	
	Для каждого СтрК Из ТаблицаКлиентов Цикл 
		КоличествоЗалогов = 0;   
		КоличествоВыкупов = 0;     
		
		Отбор = новый Структура;
		Отбор.Вставить("Клиент", СтрК.Клиент); 
		Строки = ТаблицаСтатусов.НайтиСтроки(Отбор); 
		Для каждого Выборка из строки Цикл
			Если НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) И 
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) И
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят) И 
				 НЕ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен) Тогда  
				Продолжить;
			КонецЕсли;	
			КоличествоЗалогов = КоличествоЗалогов + 1;   
			Если (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт) ИЛИ (Выборка.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение) Тогда 
			    КоличествоВыкупов = КоличествоВыкупов + 1; 
			КонецЕсли;	
		КонецЦикла;
		
		НовыйСтатус = ПроверкаСтатуса(КоличествоЗалогов, КоличествоВыкупов);  
		Если НЕ НовыйСтатус = неопределено Тогда 
			Движение = Движения.ЛБ_СтатусыЗалогодателей.Добавить();
			Движение.Период = Дата;
			Движение.Залогодатель = СтрК.Клиент;  
			Движение.Статус = НовыйСтатус;
		КонецЕсли;	
	Конеццикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
